module OaTemplater
  R_JPL_DETECT = /理\p{Z}?由.*\p{N}?(?:（|\()[^\)）\nに新可サ拡引性]*(?:）|\))+?/
  R_HEADER_SEPARATOR_DETECT = /\p{N}(?:（|\()*[^\)）\n]*(?:）|\))*(\s*:|\s*：|\s*\/|\s*／|\s*・| |　)(?:請求項|引用文献|理由|先願|実施例)/
  R_ARTICLE_SECTION = /この出願は、次の理由.*?(?:(?:\p{Z}記\p{Z})|備考)/m
  R_HEADER_SEPARATOR = /\s*:|\s*：|\s*・|\/|／| |　/
  R_HEADER_REASONS = '(?:^.{0,2}理\p{Z}*由\p{Z}*\p{N}*\p{Z}*(?:（(?:特許[^\)）\nに引性]*|新規性|新規事項|同日出願|産業上の利用可能性|サポート要件|拡大先願|進歩性|実施可能要件|発明の単一性|明確性)）)(?:(?:及び|、)  .{0,2}理\p{Z}*>由\p{Z}*\p{N}+\p{Z}*(?:（(?:新規性|拡大先願|新規事項|同日出願|産業上の利用可能性|サポート要件|進歩性|実施可能要件|発明の単一性|明確性)）))*(?:(?:及び|、)  .{0,2}理\p{Z}*由\p{Z}*\p{N}+\p{Z}*(?:（(?:新規性|拡大 先願|同日出願|新規事項|産業上の利用可能性|サポート要件|進歩性|実施可能要件|発明の単一性|明確性)）))* | (?:.{0,2}理\p{Z}*由\p{Z}*\p{N}{0,2}\p{Z}*（特許法第?\p{N}{0,2}条第?\p{N}{0,2}項）)(?:について)    )'
  R_HEADER_TYPES = /(
                       #{R_HEADER_REASONS}
                     | (?:^\s*$)
                     | (?:^\p{Z}?(?:\p{N}[－,\p{N},、]*)(?:について)*$)
                     | (?:^.{0,2}(?:本願)*(?:請\p{Z}*求\p{Z}*項|引用文献|理\p{Z}*由|備\p{Z}*考|実\p{Z}*施\p{Z}*例)(?:\p{Z}*.*\p{N}\p{Z}*)(?:[－,\p{N},、]\r*\n[－,\p{N},、].*\p{N})*(?:について)*(?:＞|）|］|】)*(?::|：$)*)
                     | (?:(?:..)?(?:＜|（|［|【)(?:本願)*(?:請\p{Z}*求\p{Z}*項|引用文献|理\p{Z}*由|備\p{Z}*考|実\p{Z}*施\p{Z}*例)(?:\p{Z}*.*\p{N}，*\p{Z}*)+：*(?:(?:について)*＞|）|］|】))
                     | (?:(?:^.{0,4})((?:＜|（|［|【)(?:本願)*(?:請\p{Z}*求\p{Z}*項|引用文献|理\p{Z}*由|備\p{Z}*考|実\p{Z}*施\p{Z}*例)\p{N}.*?(?:について)?(?:）).{0,4}$))
                     | (?:^.{0,4}(?:本\p{Z}*願)*(?:請\p{Z}*求\p{Z}*項|引用文献|理\p{Z}*由|実\p{Z}*施\p{Z}*例):*：*.*\p{N}(?:について)*\p{Z}*$)
                     | (?:(?:・)*備考:*：*)
                     | (?:^\p{Z}*（\p{N}*\p{L}*）(?:について)*$)
                     | (?:(^\s*・{0,1}理由.*[Ａ-Ｚ]))
                    )/x
  R_RESPONSE_PERIOD = /、この通知書の発送の日から６０日以内に意見書を提出して/
  R_AND_AMENDMENTS = /なお、意見書.{0,4}?手続補正書の内容を検討しました/
  R_CITATIONS_START = /(?<![\p{N}・])(引用文献(?:等については.{0,3}を参照.{0,4})|引　用　文　献　等　一　覧|引用文献(等)?一覧|\p{Z}??引用文献等|\p{Z}引\p{Z}*用\p{Z}*文\p{Z}*献|引用刊行(物)?).?(?:<\/CENTER>)*\s+\p{Z}*\p{N}+?(?:\.|．|：)*\p{Z}*/m
  R_CAPTURE_APP_NO = /特許出願の番号\p{Z}+特願(\p{N}+)\S\p{Z}{0,3}(\p{N}+)/
  R_CAPTURE_DRAFTED = /起案日\p{Z}+\p{Z}*(?:平成)*\p{Z}*(\p{N}+)年\p{Z}*(\p{N}+)月\p{Z}*(\p{N}+)/
  R_CAPTURE_MAILING_DATE = /発送日\p{Z}*平成\p{Z}*(\p{N}+)年\p{Z}*(\p{N}+)月\p{Z}*(\p{N}+)/
  R_CAPTURE_PREVIOUS_OA = /この出願については、\p{Z}*平成\p{Z}*(\p{N}+)年\p{Z}*(\p{N}+)月\p{Z}*(\p{N}+)日付け拒絶理由通知書に記載/
  R_SATEI_REASONS = /日付け拒絶理由通知書に記載した(.+)によって、拒絶をすべきもの/m 
  R_CAPTURE_AMENDMENTS_DATE = /\p{Z}*平成\p{Z}*(\p{N}+)年\p{Z}*(\p{N}+)月\p{Z}*(\p{N}+)日付け手続補正書でした/
  R_CAPTURE_RETROACTIVE = /出願日（遡及日）\p{Z}*平成(\p{N}*)年\p{Z}*(\p{N}*)月\p{Z}*(\p{N}*)日/
  R_CAPTURE_NO_REJECT_CLAIMS = /拒絶の理由を発見しない請求項＞.{1,5}(請求項.*)に\s*係\s*る\s*発\s*明\s*に\s*つ\s*い\s*て\s*/m
  R_CAPTURE_TARO = /特許庁審査官\p{Zs}+(\S+?)\p{Zs}(\S+?)\p{Zs}+(\p{N}+)\p{Zs}+(\S+)/
  R_CAPTURE_APPEAL_TARO = /審判長(?:\p{Z}*)特許庁審判官\p{Z}+(\p{L}+?)\p{Z}(((\p{L}+)))/
  R_CAPTURE_APPEAL_NO = /番号\p{Zs}*不服(\p{N}+)\S(\p{Zs}*\p{N}+)/
  R_CAPTURE_APPEAL_DRAFTED = /作成日p{Z}+\p{Z}*(?:平成)*\p{Z}*(\p{N}+)年\p{Z}*(\p{N}+)月\p{Z}*(\p{N}+)/
  R_CAPTURE_APPEAL_APP_NO = /（特許出願の番号）\p{Z}+（特願(\p{N}+)\S\p{Z}{0,3}(\p{N}+)）/
  R_CAPTURE_SHIREISHO_CODE = /特許庁長官\p{Zs}+(\p{N}+)\p{Zs}+(\S+).{1,20}特許出願人代理人/m
  R_CAPTURE_SHIREISHO_APP = /特許庁長官\p{Zs}+.+記.+特願(\p{N}+)\S(\p{N}+)/m
end
